cfd_examples/rectangular/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
x_min -1131.546593;
y_min -1096.234495;
z_min 0;
x_max 1966.416716;
y_max 1103.545934;
z_max 549.82785; 

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    Buildings
    {
        type triSurfaceMesh;
        file "Mesh_Buildings.obj";
    }
    Terrain
    {
        type triSurfaceMesh;
        file "Mesh_Terrain.obj";
    }
    Vegetation
    {
        type triSurfaceMesh;
        file "Mesh_Vegetation.obj";
    }
    Water
    {
        type triSurfaceMesh;
        file "Mesh_Water.obj";
    }
};

castellatedMeshControls
{
    maxLocalCells 10000000;
    maxGlobalCells 20000000;
    minRefinementCells 0;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 4;
    features
    (
	{
            file "Mesh_Buildings.eMesh";
            level 4;
        }
    );
    refinementSurfaces
    {
        Buildings
        {
            level (4 4);
        }
        Terrain 
        {
            level (4 4);
        }
	Water
        {
            level (4 4);
        }
	Vegetation
        {
            level (4 4);
        }
    }
    resolveFeatureAngle 10;
    refinementRegions
    {
	Buildings
        {
           mode distance;
           levels ((4.0 4) (8.0 3) (16.0 2) (32 1));
        }
 	Terrain	
        {
           mode distance;
           levels ((4.0 4) (8.0 3) (16.0 2) (32 1));
        }
	Vegetation
        {
           mode distance;
           levels ((4.0 4) (8.0 3) (16.0 2) (32 1));
        }
	Water
        {
           mode distance;
           levels ((4.0 4) (8.0 3) (16.0 2) (32 1));
        }
    }
    locationInMesh (450.2 450.3 250.3);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 1;
    tolerance 4.0;
    nSolveIter 50;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes false;
    expansionRatio 1.0;
    //finalLayerThickness 0.3;
    firstLayerThickness 0.4;
    // thickness 0.5
    minThickness 0.4;
    layers
    {
        terrain
        {
            nSurfaceLayers 2;

        }

    }
    nGrow 0;
    featureAngle 45;
    maxFaceThicknessRatio 0.5;
    nSmoothSurfaceNormals 1;
    nSmoothThickness 10;
    minMedialAxisAngle 90;
    maxThicknessToMedialRatio 0.3;
    nSmoothNormals 3;
    // nMedialAxisIter 10;
    // nSmoothDisplacement 90;
    // detectExtrusionIsland true;
    slipFeatureAngle 30;
    nRelaxIter 5;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
    nRelaxedIter 20;

}


meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-30;
    minArea -1;
    minTwist 0.05;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
    relaxed
    {
        maxNonOrtho 75;
    }
}


mergeTolerance 1e-6;


// ************************************************************************* //

