cfd_examples/rectangular/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    X0
    {
        type            patch;
        nFaces          1480;
        startFace       450504;
    }
    X1
    {
        type            patch;
        nFaces          1480;
        startFace       451984;
    }
    Y0
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          2080;
        startFace       453464;
    }
    Y1
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          2080;
        startFace       455544;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7696;
        startFace       457624;
    }
    top
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          7696;
        startFace       465320;
    }
)

// ************************************************************************* //
