cfd_examples/rectangular/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/ABLConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    #include "include/ABLConditions"
    X1
    {
	type            uniformFixedValue;
        uniformValue    constant $pressure;
    }

    "(Y0|Y1|top)"
    {
        type            symmetry;
    }

    "(X0|Vegetation|Water|Buildings|Terrain)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
