cfd_examples/rectangular/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include        "include/ABLConditions"

internalField   uniform $epsilonInlet;

boundaryField
{
    #include "include/ABLConditions"

    "(Y0|Y1|top)"
    {
        type		symmetry;
    }

    "(X0|X1)"
    {
        type            atmBoundaryLayerInletEpsilon;
        #include        "include/ABLConditions"
    }

    Buildings
    {
        type            epsilonWallFunction;
        value           uniform $epsilonInlet;
    }

    Terrain
    {
        type            atmEpsilonWallFunction;
        kappa           0.41;
        Cmu             0.09;
        z0              $z0;
        value           $z0;
    }

    Vegetation
    {
        type            atmEpsilonWallFunction;
        kappa           0.41;
        Cmu             0.09;
        z0              $z0vegetation;
        value           $z0vegetation;
    }

    Water
    {
	type            atmEpsilonWallFunction;
        kappa           0.41;
        Cmu             0.09;
        z0              $z0water;
        value           $z0water;
    }

}

// ************************************************************************* //
