cfd_examples/rectangular/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/ABLConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    #include "include/ABLConditions"
    X1
    {
        type            inletOutlet;
        inletValue      uniform $kInlet;
        value           $internalField;
    }

    "(Y0|Y1|top)"
    {
        type            symmetry;
    }

    "(X0)"
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions"
    }

    "(Terrain|Vegetation|Water|Buildings)"
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }
}


// ************************************************************************* //
